[
    {
        "id":  1,
        "title":  "Chicken Biryani",
        "image":  "assets/high res assets/Chicken Biryani.jpg",
        "summary":  "Rinse and soak basmati rice. Marinate chicken with yogurt, ginger-garlic, chili, turmeric, and garam masala. Fry onions until golden, set some aside, and cook marinated chicken in the remaining onions with tomatoes. Parboil rice to 70 percent, then layer rice and chicken in a pot, sprinkle herbs and fried onions, add saffron milk, seal, and steam on low (dum) until the rice is fluffy and the chicken is tender.",
        "preparation":  [
                            "Rinse basmati rice and soak it while you prepare the chicken.",
                            "Marinate chicken with yogurt, ginger-garlic, chili, turmeric, and garam masala.",
                            "Fry onions until golden, set some aside, then cook marinated chicken with tomatoes.",
                            "Parboil the rice to about 70 percent doneness.",
                            "Layer rice and chicken with herbs and fried onions, add saffron milk, seal, and steam on low until done."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Setup \u0026 targets",
                                          "details":  [
                                                          "Use a heavy pot/Dutch oven with a tight lid (or foil + lid).",
                                                          "Rice target: parboil to ~70% (grain is firm in the center but bends).",
                                                          "Dum target: very low heat so steam finishes cooking without scorching."
                                                      ]
                                      },
                                      {
                                          "stage":  "Rice prep",
                                          "details":  [
                                                          "Rinse basmati until water runs mostly clear.",
                                                          "Soak 20–30 minutes, then drain well."
                                                      ]
                                      },
                                      {
                                          "stage":  "Chicken marination",
                                          "details":  [
                                                          "Mix chicken with yogurt, ginger-garlic, chili, turmeric, garam masala, and salt.",
                                                          "Rest at least 30 minutes (longer = deeper flavor)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Fry onions",
                                          "details":  [
                                                          "Slice onions thin.",
                                                          "Fry in oil/ghee over medium until deep golden.",
                                                          "Remove and reserve about half for garnish; keep remaining onions and fat in the pot."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cook masala + chicken",
                                          "details":  [
                                                          "Add tomatoes to the pot; cook until thick/jammy and oil starts separating.",
                                                          "Add marinated chicken; cook until partly done and the masala clings to the chicken."
                                                      ]
                                      },
                                      {
                                          "stage":  "Parboil rice",
                                          "details":  [
                                                          "Boil plenty of salted water (optional: whole spices).",
                                                          "Add soaked rice and cook until ~70% done.",
                                                          "Drain immediately to stop cooking."
                                                      ]
                                      },
                                      {
                                          "stage":  "Layer \u0026 dum",
                                          "details":  [
                                                          "Layer chicken masala at the bottom and parboiled rice on top.",
                                                          "Add fried onions, herbs, and saffron milk; optional drizzle of ghee.",
                                                          "Seal tightly and cook on very low heat for 20–30 minutes (use a tawa/skillet under the pot if your stove runs hot).",
                                                          "Rest 10 minutes off heat; fluff gently from the edges."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "If dry: sprinkle 2–4 tbsp hot water around edges, reseal 5 minutes.",
                                                          "If sticking/burning: lower heat and add a tawa buffer immediately."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  2,
        "title":  "Spaghetti Carbonara",
        "image":  "assets/high res assets/Spaghetti Carbonara.jpg",
        "summary":  "Boil spaghetti until al dente. Render pancetta in a skillet until crisp. Whisk eggs with grated pecorino and black pepper. Toss hot pasta with pancetta and a splash of pasta water off the heat, then quickly stir in the egg-cheese mixture so it coats the strands in a silky sauce without scrambling.",
        "preparation":  [
                            "Boil spaghetti until al dente and reserve some pasta water.",
                            "Cook pancetta in a skillet until crisp.",
                            "Whisk eggs with pecorino and black pepper.",
                            "Toss hot pasta with pancetta and a splash of pasta water off the heat.",
                            "Stir in the egg mixture quickly to create a creamy sauce."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Setup \u0026 targets",
                                          "details":  [
                                                          "Goal: a silky sauce that coats pasta without scrambling the eggs.",
                                                          "Pasta water is the emulsifier—reserve 1–2 cups."
                                                      ]
                                      },
                                      {
                                          "stage":  "Egg-cheese base",
                                          "details":  [
                                                          "Whisk eggs with grated pecorino (or parmesan) and lots of black pepper.",
                                                          "Keep bowl at room temp for smoother emulsification."
                                                      ]
                                      },
                                      {
                                          "stage":  "Render pancetta",
                                          "details":  [
                                                          "Start pancetta in a cool skillet, then bring to medium heat.",
                                                          "Cook until fat renders and pieces turn crisp; turn off heat but keep fat in the pan."
                                                      ]
                                      },
                                      {
                                          "stage":  "Boil pasta",
                                          "details":  [
                                                          "Cook spaghetti in salted water until al dente.",
                                                          "Reserve pasta water before draining."
                                                      ]
                                      },
                                      {
                                          "stage":  "Combine off heat",
                                          "details":  [
                                                          "Add hot pasta to pancetta pan; toss to coat in rendered fat.",
                                                          "Let pan cool 20–40 seconds (prevents scrambling).",
                                                          "Add egg-cheese mixture while tossing constantly.",
                                                          "Add splashes of hot pasta water until glossy and creamy."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "If clumpy: add more hot pasta water and toss vigorously.",
                                                          "If eggs set: pan was too hot—move off heat earlier next time."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  3,
        "title":  "Mushroom Risotto",
        "image":  "assets/high res assets/Mushroom Risotto.jpg",
        "summary":  "Saute mushrooms in butter until browned and set aside. In the same pan, sweat onions and garlic, add arborio rice, and toast. Ladle in warm stock gradually, stirring until absorbed before adding more. When the rice is creamy and tender, fold in mushrooms, parmesan, and a final knob of butter.",
        "preparation":  [
                            "Saute mushrooms in butter until browned and set aside.",
                            "Cook onions and garlic in the same pan, then toast the arborio rice.",
                            "Add warm stock a ladle at a time, stirring until absorbed.",
                            "Continue until the rice is creamy and tender.",
                            "Fold in mushrooms, parmesan, and butter to finish."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Setup \u0026 targets",
                                          "details":  [
                                                          "Goal: creamy, flowing risotto with rice tender but slightly firm in the center.",
                                                          "Keep stock warm in a side pot so temperature stays steady."
                                                      ]
                                      },
                                      {
                                          "stage":  "Brown mushrooms",
                                          "details":  [
                                                          "Heat pan with butter/oil; add mushrooms in a single layer (work in batches if needed).",
                                                          "Cook until browned and moisture evaporates; salt at the end.",
                                                          "Remove mushrooms and reserve."
                                                      ]
                                      },
                                      {
                                          "stage":  "Aromatic base",
                                          "details":  [
                                                          "In the same pan, sauté onions (and garlic) with a pinch of salt until soft, no color."
                                                      ]
                                      },
                                      {
                                          "stage":  "Toast rice",
                                          "details":  [
                                                          "Add arborio; stir 1–2 minutes until edges look translucent and grains feel hot."
                                                      ]
                                      },
                                      {
                                          "stage":  "Add stock gradually",
                                          "details":  [
                                                          "Add one ladle of warm stock; stir until nearly absorbed.",
                                                          "Repeat for 15–20 minutes, maintaining a gentle simmer.",
                                                          "Taste near the end for doneness; adjust with small additions of stock."
                                                      ]
                                      },
                                      {
                                          "stage":  "Finish",
                                          "details":  [
                                                          "Fold mushrooms back in when rice is nearly done.",
                                                          "Off heat: stir in parmesan and a knob of butter for shine.",
                                                          "Rest 1 minute, then serve (risotto thickens quickly)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Too thick: loosen with stock.",
                                                          "Bland: correct salt at the end (cheese adds salt too)."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  4,
        "title":  "Tacos",
        "image":  "assets/high res assets/Tacos.jpg",
        "summary":  "Brown ground meat with onion and garlic, then season with chili powder, cumin, paprika, and a splash of broth. Simmer until thickened. Warm tortillas, then fill with meat, shredded lettuce, salsa, and cheese. Finish with lime and cilantro.",
        "preparation":  [
                            "Brown ground meat with onion and garlic.",
                            "Season with chili powder, cumin, paprika, and a splash of broth.",
                            "Simmer until the mixture thickens.",
                            "Warm tortillas and fill with meat, lettuce, salsa, and cheese.",
                            "Finish with lime juice and cilantro."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Cook aromatics",
                                          "details":  [
                                                          "Heat a skillet with a little oil.",
                                                          "Cook chopped onion until soft; add garlic for 30 seconds (don’t brown)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Brown meat",
                                          "details":  [
                                                          "Add ground meat; break into small crumbles.",
                                                          "Cook until browned with some crisp bits; drain excess fat if needed."
                                                      ]
                                      },
                                      {
                                          "stage":  "Season \u0026 simmer",
                                          "details":  [
                                                          "Add chili powder, cumin, paprika, and salt; stir 30 seconds to bloom spices.",
                                                          "Add a splash of broth/water; simmer uncovered 5–8 minutes until saucy."
                                                      ]
                                      },
                                      {
                                          "stage":  "Warm tortillas",
                                          "details":  [
                                                          "Warm in a dry skillet 10–20 seconds per side (or briefly over flame).",
                                                          "Keep warm in a towel."
                                                      ]
                                      },
                                      {
                                          "stage":  "Assemble",
                                          "details":  [
                                                          "Add meat first, then lettuce, salsa, cheese.",
                                                          "Finish with lime and cilantro."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Too watery: simmer longer.",
                                                          "Too dry: add a little broth and a squeeze of lime."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  5,
        "title":  "Vegetable Stir-Fry",
        "image":  "assets/high res assets/Vegetable Stir-Fry.jpg",
        "summary":  "Heat a wok until smoking, add oil, then stir-fry garlic and ginger. Add firm vegetables first, then tender ones, cooking quickly so they stay crisp. Pour in a mix of soy sauce, vinegar, and a little cornstarch slurry, tossing until glossy. Finish with sesame oil.",
        "preparation":  [
                            "Heat a wok until very hot and add oil.",
                            "Stir-fry garlic and ginger briefly.",
                            "Add firm vegetables first, then tender ones, keeping them crisp.",
                            "Add soy sauce, vinegar, and cornstarch slurry, tossing until glossy.",
                            "Finish with a drizzle of sesame oil."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Prep before heat",
                                          "details":  [
                                                          "Chop all vegetables and keep in separate piles: firm (carrot/broccoli) and tender (pepper/zucchini/greens).",
                                                          "Mix sauce: soy sauce + vinegar + water + cornstarch slurry (stir right before using)."
                                                      ]
                                      },
                                      {
                                          "stage":  "High-heat stir-fry",
                                          "details":  [
                                                          "Heat wok until very hot; add oil (it should shimmer immediately).",
                                                          "Add garlic and ginger for 10–15 seconds (avoid burning)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cook in stages",
                                          "details":  [
                                                          "Add firm vegetables first; stir-fry 2–3 minutes.",
                                                          "Add tender vegetables next; stir-fry 1–2 minutes.",
                                                          "Add leafy greens last; cook 30–60 seconds."
                                                      ]
                                      },
                                      {
                                          "stage":  "Glaze",
                                          "details":  [
                                                          "Stir sauce again, pour around the edge of the wok, and toss.",
                                                          "Cook 30–60 seconds until glossy and thickened."
                                                      ]
                                      },
                                      {
                                          "stage":  "Finish",
                                          "details":  [
                                                          "Turn off heat; drizzle sesame oil and toss once.",
                                                          "Serve immediately."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "If soggy: pan wasn’t hot enough or it was overcrowded—cook in batches."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  6,
        "title":  "Margherita Pizza",
        "image":  "assets/high res assets/Margherita Pizza.jpg",
        "summary":  "Stretch pizza dough, spread crushed tomatoes with salt and olive oil, and top with fresh mozzarella. Bake on a very hot stone or steel until blistered and browned. Add fresh basil and a final drizzle of olive oil before serving.",
        "preparation":  [
                            "Preheat the oven with a stone or steel as hot as possible.",
                            "Stretch the dough and spread crushed tomatoes with salt and olive oil.",
                            "Top with fresh mozzarella.",
                            "Bake until blistered and browned.",
                            "Add fresh basil and a drizzle of olive oil."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Setup \u0026 targets",
                                          "details":  [
                                                          "Use a pizza stone/steel and preheat for 45–60 minutes at max oven temperature.",
                                                          "Keep toppings minimal: thin sauce, well-drained mozzarella."
                                                      ]
                                      },
                                      {
                                          "stage":  "Prepare toppings",
                                          "details":  [
                                                          "Drain/pat mozzarella dry; tear into pieces.",
                                                          "Mix crushed tomatoes with salt and olive oil."
                                                      ]
                                      },
                                      {
                                          "stage":  "Shape dough",
                                          "details":  [
                                                          "Stretch from the center outward, leaving a thicker rim.",
                                                          "Avoid deflating the edge for a better crust."
                                                      ]
                                      },
                                      {
                                          "stage":  "Top",
                                          "details":  [
                                                          "Spread a thin layer of sauce.",
                                                          "Add mozzarella pieces spaced out (avoid overloading)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Bake",
                                          "details":  [
                                                          "Slide onto stone/steel; bake 6–10 minutes until blistered and browned.",
                                                          "Rotate once if your oven has hot spots."
                                                      ]
                                      },
                                      {
                                          "stage":  "Finish",
                                          "details":  [
                                                          "Add basil after baking so it stays fresh.",
                                                          "Drizzle olive oil; slice and serve."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Pale bottom: stone not hot enough or rack too high.",
                                                          "Watery top: mozzarella too wet or too much sauce."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  7,
        "title":  "Grilled Salmon",
        "image":  "assets/high res assets/Grilled Salmon.jpg",
        "summary":  "Pat salmon dry, season with salt, pepper, and a little oil. Grill skin-side down over medium-high heat until the skin is crisp and the flesh releases easily. Flip briefly to finish, then rest and serve with lemon and herbs.",
        "preparation":  [
                            "Pat salmon dry and season with salt, pepper, and oil.",
                            "Heat the grill and oil the grates.",
                            "Grill skin-side down until crisp and mostly cooked through.",
                            "Flip briefly to finish the top side.",
                            "Rest and serve with lemon and herbs."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Prep",
                                          "details":  [
                                                          "Pat salmon dry for better sear.",
                                                          "Season with salt and pepper; brush lightly with oil.",
                                                          "Let sit 10 minutes after salting for improved texture."
                                                      ]
                                      },
                                      {
                                          "stage":  "Heat grill",
                                          "details":  [
                                                          "Preheat to medium-high.",
                                                          "Clean and oil grates thoroughly to prevent sticking."
                                                      ]
                                      },
                                      {
                                          "stage":  "Grill skin-side down",
                                          "details":  [
                                                          "Place salmon skin-side down; do not move it for 4–6 minutes.",
                                                          "Watch the side: color climbs up as it cooks; skin becomes crisp."
                                                      ]
                                      },
                                      {
                                          "stage":  "Flip \u0026 finish",
                                          "details":  [
                                                          "Flip only when it releases easily.",
                                                          "Cook 1–2 minutes more to finish the top."
                                                      ]
                                      },
                                      {
                                          "stage":  "Rest \u0026 serve",
                                          "details":  [
                                                          "Rest 2–3 minutes.",
                                                          "Serve with lemon and herbs."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "If it sticks, it’s not ready—wait 30–60 seconds and try again."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  8,
        "title":  "Chicken Caesar Salad",
        "image":  "assets/high res assets/Chicken Caesar Salad.jpg",
        "summary":  "Season and grill chicken until cooked through, then slice. Toss romaine with Caesar dressing, add croutons and parmesan, and top with the warm chicken. Finish with extra pepper and a squeeze of lemon.",
        "preparation":  [
                            "Season and grill chicken until cooked through.",
                            "Slice the chicken into strips.",
                            "Toss romaine with Caesar dressing, croutons, and parmesan.",
                            "Top with chicken and finish with pepper and lemon."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Cook chicken",
                                          "details":  [
                                                          "Season chicken well; grill or sear until fully cooked and juices run clear.",
                                                          "Rest 5 minutes, then slice."
                                                      ]
                                      },
                                      {
                                          "stage":  "Prep romaine",
                                          "details":  [
                                                          "Wash and dry thoroughly (dry leaves hold dressing better).",
                                                          "Chop into bite-size pieces."
                                                      ]
                                      },
                                      {
                                          "stage":  "Dress",
                                          "details":  [
                                                          "Toss romaine with Caesar dressing until lightly coated.",
                                                          "Add croutons and parmesan; toss once to avoid sogginess."
                                                      ]
                                      },
                                      {
                                          "stage":  "Assemble",
                                          "details":  [
                                                          "Top salad with warm sliced chicken.",
                                                          "Finish with black pepper and a squeeze of lemon."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Watery salad usually means romaine wasn’t dried enough."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  9,
        "title":  "White Sauce Pasta",
        "image":  "assets/high res assets/White Sauce Pasta.jpg",
        "summary":  "Cook pasta until al dente. In a pan, melt butter, whisk in flour, and cook briefly to form a roux. Slowly add warm milk while whisking until thick. Season with salt, pepper, garlic, and herbs, then toss with pasta and parmesan.",
        "preparation":  [
                            "Cook pasta until al dente and drain.",
                            "Melt butter, whisk in flour, and cook briefly to form a roux.",
                            "Whisk in warm milk until the sauce thickens.",
                            "Season with salt, pepper, garlic, and herbs.",
                            "Toss pasta with the sauce and parmesan."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Cook pasta",
                                          "details":  [
                                                          "Boil pasta in salted water until al dente.",
                                                          "Reserve 1/2 cup pasta water; drain."
                                                      ]
                                      },
                                      {
                                          "stage":  "Make roux",
                                          "details":  [
                                                          "Melt butter on medium.",
                                                          "Whisk in flour; cook 1–2 minutes until it smells nutty (no raw flour aroma)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Build sauce",
                                          "details":  [
                                                          "Warm milk (helps prevent lumps).",
                                                          "Add milk gradually, whisking smooth each time.",
                                                          "Simmer until it coats the back of a spoon."
                                                      ]
                                      },
                                      {
                                          "stage":  "Season",
                                          "details":  [
                                                          "Add salt, pepper, garlic, and herbs to taste.",
                                                          "Add parmesan for richness."
                                                      ]
                                      },
                                      {
                                          "stage":  "Combine",
                                          "details":  [
                                                          "Toss pasta in sauce.",
                                                          "Loosen with reserved pasta water if needed."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Lumps: whisk vigorously; strain if necessary."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  10,
        "title":  "Pancakes",
        "image":  "assets/high res assets/Pancakes.jpg",
        "summary":  "Whisk flour, sugar, baking powder, and salt. Mix in milk, eggs, and melted butter until just combined. Ladle batter onto a hot griddle and cook until bubbles form, then flip and cook until golden. Serve with butter and syrup.",
        "preparation":  [
                            "Whisk flour, sugar, baking powder, and salt.",
                            "Mix in milk, eggs, and melted butter until just combined.",
                            "Pour batter onto a hot griddle and cook until bubbles form.",
                            "Flip and cook until golden.",
                            "Serve with butter and syrup."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Mix batter",
                                          "details":  [
                                                          "Whisk dry ingredients together.",
                                                          "Whisk wet ingredients separately, then pour into dry.",
                                                          "Mix just until combined—small lumps are fine.",
                                                          "Rest batter 5–10 minutes for fluffier pancakes."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cook",
                                          "details":  [
                                                          "Heat griddle/pan to medium; lightly grease.",
                                                          "Ladle batter; cook 2–3 minutes until bubbles set and edges look dry.",
                                                          "Flip; cook 1–2 minutes until golden."
                                                      ]
                                      },
                                      {
                                          "stage":  "Serve",
                                          "details":  [
                                                          "Serve hot with butter and syrup."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Pale: heat too low.",
                                                          "Burnt outside/raw inside: heat too high."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  11,
        "title":  "Chicken Curry",
        "image":  "assets/high res assets/chicken curry.jpg",
        "summary":  "Saute onions until golden, add ginger-garlic paste and spices, then cook tomatoes into a thick masala. Add chicken pieces and sear, then pour in water or coconut milk and simmer until tender. Finish with garam masala and cilantro.",
        "preparation":  [
                            "Saute onions until golden.",
                            "Add ginger-garlic paste and spices, then cook tomatoes into a masala.",
                            "Add chicken pieces and sear.",
                            "Pour in water or coconut milk and simmer until tender.",
                            "Finish with garam masala and cilantro."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Build flavor base",
                                          "details":  [
                                                          "Cook onions with oil and a pinch of salt until golden (don’t rush—this is depth).",
                                                          "Add ginger-garlic paste; cook 1–2 minutes to remove rawness.",
                                                          "Add spices and stir briefly to bloom."
                                                      ]
                                      },
                                      {
                                          "stage":  "Tomato masala",
                                          "details":  [
                                                          "Add tomatoes; cook until thick and oil separates from the masala."
                                                      ]
                                      },
                                      {
                                          "stage":  "Sear chicken",
                                          "details":  [
                                                          "Add chicken; stir to coat and cook until it loses raw color.",
                                                          "Let it sear briefly for better flavor."
                                                      ]
                                      },
                                      {
                                          "stage":  "Simmer",
                                          "details":  [
                                                          "Add water or coconut milk to desired gravy thickness.",
                                                          "Simmer gently 20–35 minutes until chicken is tender."
                                                      ]
                                      },
                                      {
                                          "stage":  "Finish",
                                          "details":  [
                                                          "Add garam masala at the end for aroma.",
                                                          "Finish with cilantro; rest 5 minutes before serving."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "If it tastes raw: masala wasn’t cooked enough—reduce longer."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  12,
        "title":  "Chocolate Cake",
        "image":  "assets/high res assets/chocolate cake.jpg",
        "summary":  "Whisk dry ingredients, then add eggs, milk, and melted butter. Mix until smooth and bake in a greased pan until a toothpick comes out clean. Cool, then frost with a cocoa buttercream or ganache.",
        "preparation":  [
                            "Whisk dry ingredients together.",
                            "Add eggs, milk, and melted butter and mix until smooth.",
                            "Bake in a greased pan until a toothpick comes out clean.",
                            "Cool completely.",
                            "Frost with buttercream or ganache."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Prep",
                                          "details":  [
                                                          "Preheat oven.",
                                                          "Grease and line the cake pan (paper helps release cleanly)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Mix",
                                          "details":  [
                                                          "Whisk dry ingredients thoroughly to distribute leavening evenly.",
                                                          "Add eggs, milk, and melted butter; mix just until smooth (avoid overmixing)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Bake",
                                          "details":  [
                                                          "Pour into pan; tap once to release bubbles.",
                                                          "Bake until a toothpick comes out clean (a few moist crumbs are okay)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cool \u0026 frost",
                                          "details":  [
                                                          "Cool 10 minutes in pan, then transfer to rack to cool completely.",
                                                          "Frost only when fully cool to prevent melting."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Sinking center: underbaked, oven too hot, or batter overmixed."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  13,
        "title":  "Caprese Salad",
        "image":  "assets/high res assets/Caprese Salad.jpg",
        "summary":  "Slice ripe tomatoes and fresh mozzarella. Arrange with basil leaves, drizzle with olive oil and balsamic reduction, and season with flaky salt and pepper.",
        "preparation":  [
                            "Slice ripe tomatoes and fresh mozzarella.",
                            "Arrange on a plate with basil leaves.",
                            "Drizzle with olive oil and balsamic reduction.",
                            "Season with salt and pepper."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Slice",
                                          "details":  [
                                                          "Slice tomatoes and mozzarella into even rounds for balanced bites."
                                                      ]
                                      },
                                      {
                                          "stage":  "Arrange",
                                          "details":  [
                                                          "Alternate tomato and mozzarella slices.",
                                                          "Tuck basil leaves between layers."
                                                      ]
                                      },
                                      {
                                          "stage":  "Season \u0026 finish",
                                          "details":  [
                                                          "Drizzle olive oil.",
                                                          "Season with flaky salt and black pepper.",
                                                          "Optional: balsamic reduction (use sparingly).",
                                                          "Serve immediately."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "This dish depends on tomato quality—use ripe, flavorful tomatoes."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  14,
        "title":  "Vegetable Soup",
        "image":  "assets/high res assets/vegetable soup.jpg",
        "summary":  "Saute onions, carrots, and celery until softened. Add garlic, herbs, chopped vegetables, and broth. Simmer until vegetables are tender, then season to taste and finish with parsley.",
        "preparation":  [
                            "Saute onions, carrots, and celery until softened.",
                            "Add garlic, herbs, chopped vegetables, and broth.",
                            "Simmer until vegetables are tender.",
                            "Season to taste and finish with parsley."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Sweat the base",
                                          "details":  [
                                                          "In a pot, cook onion, carrot, and celery with oil and a pinch of salt for 8–10 minutes until softened."
                                                      ]
                                      },
                                      {
                                          "stage":  "Add aromatics",
                                          "details":  [
                                                          "Add garlic and herbs; stir 30 seconds until fragrant."
                                                      ]
                                      },
                                      {
                                          "stage":  "Simmer",
                                          "details":  [
                                                          "Add chopped vegetables and broth to cover.",
                                                          "Bring to a gentle simmer and cook 20–35 minutes until tender."
                                                      ]
                                      },
                                      {
                                          "stage":  "Season \u0026 finish",
                                          "details":  [
                                                          "Taste and adjust salt and pepper.",
                                                          "Finish with parsley."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Flat flavor: add salt and a small splash of acid (lemon or vinegar).",
                                                          "If adding pasta/beans, add near the end so they don’t go mushy."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  15,
        "title":  "Veg Grilled Sandwiches",
        "image":  "assets/high res assets/Veg Grilled Sandwiches.jpg",
        "summary":  "Spread chutney or mayo on bread, layer grilled veggies and cheese, then toast in a pan or sandwich press until golden and melty. Slice and serve hot.",
        "preparation":  [
                            "Spread chutney or mayo on bread.",
                            "Layer grilled vegetables and cheese.",
                            "Toast in a pan or sandwich press until golden and melty.",
                            "Slice and serve hot."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Prep fillings",
                                          "details":  [
                                                          "Lightly grill/cook vegetables first to remove excess moisture.",
                                                          "Season veggies with salt and pepper."
                                                      ]
                                      },
                                      {
                                          "stage":  "Assemble",
                                          "details":  [
                                                          "Spread chutney/mayo on the inside; butter the outside for better browning.",
                                                          "Layer vegetables and cheese evenly (don’t overstuff)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Toast",
                                          "details":  [
                                                          "Cook on medium heat in a pan or press for 3–5 minutes until golden and cheese melts.",
                                                          "Press gently for even contact."
                                                      ]
                                      },
                                      {
                                          "stage":  "Serve",
                                          "details":  [
                                                          "Rest 1 minute (helps cheese set slightly), then slice and serve hot."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Soggy sandwich: fillings were wet or sauces were too heavy—dry fillings first."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  16,
        "title":  "Shrimp Scampi",
        "image":  "assets/high res assets/Shrimp scampi.jpg",
        "summary":  "Sear shrimp briefly in butter and olive oil, add garlic and red pepper flakes, then deglaze with white wine and lemon. Toss with parsley and serve over pasta or with crusty bread.",
        "preparation":  [
                            "Sear shrimp in butter and olive oil.",
                            "Add garlic and red pepper flakes.",
                            "Deglaze with white wine and lemon.",
                            "Toss with parsley and serve."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Sear shrimp",
                                          "details":  [
                                                          "Pat shrimp dry and season lightly.",
                                                          "Sear in hot butter + olive oil for 30–60 seconds per side until just pink; remove."
                                                      ]
                                      },
                                      {
                                          "stage":  "Aromatics",
                                          "details":  [
                                                          "Lower heat and add garlic + red pepper flakes for 20–30 seconds (don’t burn)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Deglaze",
                                          "details":  [
                                                          "Add white wine; simmer 1–2 minutes to reduce.",
                                                          "Add lemon juice (and zest if using)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Finish",
                                          "details":  [
                                                          "Return shrimp to pan for 30 seconds to warm through.",
                                                          "Toss with parsley; serve over pasta or with bread."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Rubbery shrimp means overcooked—pull earlier; they finish in sauce."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  17,
        "title":  "Chicken Burger",
        "image":  "assets/high res assets/chicken burger.jpg",
        "summary":  "Season ground chicken, form patties, and sear on a hot skillet until browned. Finish cooking through, toast buns, and assemble with lettuce, tomato, onion, and sauce.",
        "preparation":  [
                            "Season ground chicken and form patties.",
                            "Sear on a hot skillet until browned.",
                            "Finish cooking until done.",
                            "Toast buns and assemble with toppings and sauce."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Form patties",
                                          "details":  [
                                                          "Season ground chicken with salt, pepper, and preferred spices.",
                                                          "Optional binder (breadcrumbs/egg) helps structure.",
                                                          "Form patties slightly wider than buns (they shrink)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cook",
                                          "details":  [
                                                          "Heat skillet to medium-high with oil.",
                                                          "Cook 4–5 minutes first side until browned.",
                                                          "Flip and cook 4–6 minutes until fully cooked through.",
                                                          "Optional: add cheese and cover for the last minute to melt."
                                                      ]
                                      },
                                      {
                                          "stage":  "Toast \u0026 assemble",
                                          "details":  [
                                                          "Toast buns cut-side down until golden.",
                                                          "Assemble with sauce, lettuce, tomato, onion, and patty."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Dry patty: avoid overmixing and don’t overcook."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  18,
        "title":  "Ratatouille",
        "image":  "assets/high res assets/ratatouille.jpg",
        "summary":  "Saute onions and garlic, then add eggplant, zucchini, and peppers. Cook down with tomatoes, thyme, and bay until tender and jammy. Serve warm with bread or over rice.",
        "preparation":  [
                            "Saute onions and garlic until softened.",
                            "Add eggplant, zucchini, and peppers and cook briefly.",
                            "Add tomatoes, thyme, and bay and simmer until tender.",
                            "Serve warm with bread or over rice."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Optional eggplant step",
                                          "details":  [
                                                          "Salt eggplant cubes/slices and rest 20 minutes, then pat dry (improves texture and reduces bitterness)."
                                                      ]
                                      },
                                      {
                                          "stage":  "Aromatics",
                                          "details":  [
                                                          "Cook onions in الزيت/olive oil until soft; add garlic for 30 seconds."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cook vegetables in stages",
                                          "details":  [
                                                          "Add eggplant first; cook until it starts softening.",
                                                          "Add zucchini and peppers; cook briefly to combine flavors."
                                                      ]
                                      },
                                      {
                                          "stage":  "Simmer with tomatoes",
                                          "details":  [
                                                          "Add tomatoes, thyme, bay, and salt.",
                                                          "Simmer 25–40 minutes until tender and jammy."
                                                      ]
                                      },
                                      {
                                          "stage":  "Finish",
                                          "details":  [
                                                          "Taste and adjust salt; drizzle olive oil.",
                                                          "Serve warm with bread or over rice."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Watery: simmer uncovered longer to concentrate."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  19,
        "title":  "Fried Rice",
        "image":  "assets/high res assets/fried rice.jpg",
        "summary":  "Use cold cooked rice. Scramble eggs in a hot wok, then stir-fry vegetables and add rice. Season with soy sauce, stir until hot and slightly crisp, and finish with scallions.",
        "preparation":  [
                            "Use cold cooked rice for best texture.",
                            "Scramble eggs in a hot wok and set aside.",
                            "Stir-fry vegetables, then add rice.",
                            "Season with soy sauce and stir until hot and slightly crisp.",
                            "Return eggs and finish with scallions."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Prep",
                                          "details":  [
                                                          "Use cold, dry rice (day-old is best). Break up clumps before cooking.",
                                                          "Beat eggs; prep chopped vegetables and scallions."
                                                      ]
                                      },
                                      {
                                          "stage":  "Scramble eggs",
                                          "details":  [
                                                          "Heat wok very hot with oil.",
                                                          "Scramble eggs quickly; remove and reserve."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cook vegetables",
                                          "details":  [
                                                          "Add a bit more oil; stir-fry vegetables until crisp-tender."
                                                      ]
                                      },
                                      {
                                          "stage":  "Fry rice",
                                          "details":  [
                                                          "Add rice; spread it out and let it sit 20–30 seconds to crisp slightly.",
                                                          "Toss and repeat once or twice."
                                                      ]
                                      },
                                      {
                                          "stage":  "Season \u0026 finish",
                                          "details":  [
                                                          "Add soy sauce around the edge; toss.",
                                                          "Return eggs; add scallions.",
                                                          "Optional: a few drops of sesame oil at the end."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Mushy: rice wasn’t cold/dry or pan was overcrowded—cook in batches."
                                                      ]
                                      }
                                  ]
    },
    {
        "id":  20,
        "title":  "Tiramisu",
        "image":  "assets/high res assets/tiramisu.jpg",
        "summary":  "Whisk mascarpone with sugar and fold in whipped cream. Dip ladyfingers in strong coffee, layer with cream, and repeat. Chill several hours, then dust with cocoa before serving.",
        "preparation":  [
                            "Whisk mascarpone with sugar and fold in whipped cream.",
                            "Dip ladyfingers in strong coffee briefly.",
                            "Layer ladyfingers and cream in a dish, repeating as needed.",
                            "Chill for several hours.",
                            "Dust with cocoa before serving."
                        ],
        "detailed_instructions":  [
                                      {
                                          "stage":  "Make cream",
                                          "details":  [
                                                          "Whisk mascarpone with sugar until smooth.",
                                                          "Fold in whipped cream gently to keep it airy."
                                                      ]
                                      },
                                      {
                                          "stage":  "Prepare coffee",
                                          "details":  [
                                                          "Brew strong coffee and cool completely.",
                                                          "Optional: add a small amount of liqueur."
                                                      ]
                                      },
                                      {
                                          "stage":  "Dip ladyfingers",
                                          "details":  [
                                                          "Dip each ladyfinger 1–2 seconds only; they should absorb but not collapse."
                                                      ]
                                      },
                                      {
                                          "stage":  "Layer",
                                          "details":  [
                                                          "Layer dipped ladyfingers in a dish.",
                                                          "Spread an even layer of cream.",
                                                          "Repeat, ending with cream."
                                                      ]
                                      },
                                      {
                                          "stage":  "Chill \u0026 finish",
                                          "details":  [
                                                          "Chill at least 4–6 hours (overnight is best).",
                                                          "Dust with cocoa right before serving."
                                                      ]
                                      },
                                      {
                                          "stage":  "Cues \u0026 fixes",
                                          "details":  [
                                                          "Soggy tiramisu: coffee was warm or ladyfingers were dipped too long—dip faster next time."
                                                      ]
                                      }
                                  ]
    }
]
